In [2]:
import pandas as pd
import numpy as np
from scipy import stats
import seaborn as sns

In [3]:
df =  pd.read_csv('C:/Users/ZMHD022/Desktop/home_credit/home-credit-default-risk/application_train.csv')

In [4]:
df.shape

(307511, 122)

In [6]:
df1 =df[['SK_ID_CURR','TARGET','AMT_INCOME_TOTAL','AMT_CREDIT','AMT_ANNUITY','AMT_GOODS_PRICE','NAME_TYPE_SUITE','NAME_INCOME_TYPE','NAME_EDUCATION_TYPE']]

In [9]:
df1.shape

(307511, 9)

In [7]:
df2=df[['SK_ID_CURR','TARGET','FLAG_MOBIL','FLAG_EMP_PHONE','FLAG_WORK_PHONE','FLAG_CONT_MOBILE','FLAG_PHONE','FLAG_EMAIL']]

In [5]:
df2.shape

(307511, 8)

In [14]:
pd.crosstab(df1['TARGET'], df1['NAME_EDUCATION_TYPE'])

NAME_EDUCATION_TYPE,Academic degree,Higher education,Incomplete higher,Lower secondary,Secondary / secondary special
TARGET,,,,,
0,161,70854,9405,3399,198867
1,3,4009,872,417,19524

In [15]:
df1.to_csv(r'C:/Users/ZMHD022/Desktop/home_credit/home-credit-default-risk\test1.csv',index = None, header=True)

In [19]:
df3 = df1['AMT_CREDIT'].sub(df1['AMT_GOODS_PRICE'], axis = 0)

In [25]:
df3.shape

(307511,)

In [26]:
sum(n < 0 for n in df3.values.flatten())

260

In [27]:
sum(n > 0 for n in df3.values.flatten())

198763

In [30]:
sum(n == 0 for n in df3.values.flatten())

108210

In [31]:
df3.isnull().sum().sum()

278

In [20]:
df4 = df3,df1['TARGET']

In [24]:
df1.corr()

,SK_ID_CURR,TARGET,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,AMT_GOODS_PRICE
SK_ID_CURR,1.000000,-0.002108,-0.001820,-0.000343,-0.000433,-0.000232
TARGET,-0.002108,1.000000,-0.003982,-0.030369,-0.012817,-0.039645
AMT_INCOME_TOTAL,-0.001820,-0.003982,1.000000,0.156870,0.191657,0.159610
AMT_CREDIT,-0.000343,-0.030369,0.156870,1.000000,0.770138,0.986968
AMT_ANNUITY,-0.000433,-0.012817,0.191657,0.770138,1.000000,0.775109
AMT_GOODS_PRICE,-0.000232,-0.039645,0.159610,0.986968,0.775109,1.000000

In [32]:
df1['AMT_GOODS_PRICE'].isnull().sum().sum()

278

In [33]:
df1['AMT_CREDIT'].isnull().sum().sum()

0

In [10]:
df2.to_csv(r'C:/Users/ZMHD022/Desktop/home_credit/home-credit-default-risk\test2.csv',index = None, header=True)

In [11]:
df2 =df[['SK_ID_CURR','TARGET']]

In [13]:
df2.head()

   SK_ID_CURR  TARGET
0      100002       1
1      100003       0
2      100004       0
3      100006       0
4      100007       0

In [14]:
df2.to_csv(r'C:/Users/ZMHD022/Desktop/home_credit/home-credit-default-risk\target.csv',index = None, header=True)

In [15]:
df2.shape

(307511, 2)